In [15]:
%run import_file.ipynb

Python version is 3.7.5 (tags/v3.7.5:5c02a39a0b, Oct 15 2019, 00:11:34) [MSC v.1916 64 bit (AMD64)]
Pandas version is 1.0.3
C:/Users/20193815/Documents/Datasets/data.csv
These columns are present in the file:
_id                           object
id_str                       float64
text                          object
in_reply_to_status_id_str    float64
user.id_str                  float64
entities.user_mentions        object
lang                          object
timestamp_ms                 float64
dtype: object

Please specify your DataFrame name:  df

timestamp converted to datetime dtype
Dtypes after transformation:
 id_str                                Int64
text                                 object
in_reply_to_status_id_str             Int64
user.id_str                           Int64
entities.user_mentions               object
lang                                 object
timestamp_ms                          Int64
created_at                   datetime64[ns]
dtype: object

In [2]:
basic_with_sentiment.head()

,Unnamed: 0,_id,created_at,id,id_str,text,user.id_str,lang,timestamp_ms,sentiment
0,0,5ec66ff9f3c74bef68594542,Wed May 22 12:20:00 +0000 2019,1.13117e+18,1.131173e+18,La ruta de easyJet entre Londres y Menorca tra...,3.933741e+08,es,1.558528e+12,0
1,1,5ec66ff9f3c74bef68594543,Wed May 22 12:20:01 +0000 2019,1.13117e+18,1.131173e+18,RT @bttr_as1: @goody_tracy Here’s a list of so...,3.420691e+09,en,1.558528e+12,1
2,2,5ec66ff9f3c74bef68594544,Wed May 22 12:20:02 +0000 2019,1.13117e+18,1.131173e+18,@British_Airways,3.943766e+08,und,1.558528e+12,0
3,3,5ec66ff9f3c74bef68594545,Wed May 22 12:20:12 +0000 2019,1.13117e+18,1.131173e+18,RT @TheRaceRadio: Nice change by @AmericanAir....,3.648856e+07,en,1.558528e+12,1
4,4,5ec66ff9f3c74bef68594546,Wed May 22 12:20:28 +0000 2019,1.13117e+18,1.131173e+18,RT @sandeeprrao1991: BREAKING:-\nKLM to fly 3x...,1.419335e+07,en,1.558528e+12,0

In [4]:
%run import_file.ipynb

Python version is 3.7.5 (tags/v3.7.5:5c02a39a0b, Oct 15 2019, 00:11:34) [MSC v.1916 64 bit (AMD64)]
Pandas version is 1.0.3
C:/Users/20193815/Documents/Data Challenge/conversation_full.csv
_id                       object
in_reply_to_status_id    float64
dtype: object

Please specify your DataFrame name df_conversations

Dtypes after transformation:
 in_reply_to_status_id    Int64
dtype: object

In [5]:
df_conversations

         in_reply_to_status_id
0                         <NA>
1                         <NA>
2          1131032916232826880
3                         <NA>
4                         <NA>
...                        ...
6454270                   <NA>
6454271                   <NA>
6454272                   <NA>
6454273                   <NA>
6454274                   <NA>

[6454275 rows x 1 columns]